
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>方式二：部署在云上 · HEXO电子书</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Icecold">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-toggle-chapters/toggle.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-click-reveal/click_reveal.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-accordion/accordion.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="排版.html" />
    
    
    <link rel="prev" href="第二章第一节.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="目录.html">
            
                <a href="目录.html">
            
                    
                    目录
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="第一章.html">
            
                <a href="第一章.html">
            
                    
                    第一章：本地搭建Hexo博客
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="第二章.html">
            
                <a href="第二章.html">
            
                    
                    第二章：Hexo博客网上托管
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="第二章第一节.html">
            
                <a href="第二章第一节.html">
            
                    
                    方式一：部署在Github
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.2" data-path="第二章第二节.html">
            
                <a href="第二章第二节.html">
            
                    
                    方式二：部署在云上
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="排版.html">
            
                <a href="排版.html">
            
                    
                    排版
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >方式二：部署在云上</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x65B9;&#x5F0F;&#x4E8C;&#xFF1A;&#x90E8;&#x7F72;&#x5728;&#x4E91;&#x4E0A;">&#x65B9;&#x5F0F;&#x4E8C;&#xFF1A;&#x90E8;&#x7F72;&#x5728;&#x4E91;&#x4E0A;</h1>
<p>&#x90E8;&#x7F72;&#x5728; <a href="[https:/baike.baidu.com/item/%E4%BA%91%E6%9C%8D%E5%8A%A1%E5%99%A8](https:/baike.baidu.com/item/&#x4E91;&#x670D;&#x52A1;&#x5668;">&#x4E91;&#x670D;&#x52A1;&#x5668;</a>) &#x4E0A;&#xFF0C;&#x5E38;&#x89C1;&#x7684; &#x4E91;&#x670D;&#x52A1;&#x5668; &#x56FD;&#x5185; &#x5982;<a href="https://www.aliyun.com/" target="_blank">&#x963F;&#x91CC;&#x4E91;</a> <a href="https://cloud.tencent.com/" target="_blank">&#x817E;&#x8BAF;&#x4E91;</a> &#x7B49;&#x3002;&#x5F53;&#x7136;&#x73B0;&#x5728;&#x7684;&#x4E91;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x8C13;&#x201C;&#x904D;&#x5730;&#x5F00;&#x82B1;&#x201D;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x672C;&#x6559;&#x7A0B;&#x4E0A;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x963F;&#x91CC;&#x4E91;</p>
<p>&#x81EA;&#x884C;&#x5728;&#x963F;&#x91CC;&#x4E91;&#x4E0A;&#x6CE8;&#x518C;&#x5B9E;&#x540D;&#x8BA4;&#x8BC1;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5B66;&#x751F;&#x7684;&#x8BDD;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5B66;&#x751F;&#x8BA4;&#x8BC1;&#x6709;&#x4F18;&#x60E0;&#x3002;&#x7B2C;&#x4E00;&#x6B21;&#x4F7F;&#x7528;&#x963F;&#x91CC;&#x4E91;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x514D;&#x8D39;&#x4E00;&#x4E2A;&#x6708;&#x7684;&#x4F7F;&#x7528;&#x6743;&#x9650;&#x3002;&#x963F;&#x91CC;&#x4E91;&#x5B98;&#x7F51;&#x4E0A;&#x7684;&#x6559;&#x7A0B;&#x771F;&#x7684;&#x975E;&#x5E38;&#x4E30;&#x5BCC;&#xFF0C;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x5173;&#x4E8E;&#x4E91;&#x7684;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x77E5;&#x8BC6;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x76F4;&#x63A5;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x5982;&#x4F55;&#x90E8;&#x7F72;&#x3002;</p>
<h2 id="&#x8D2D;&#x4E70;&#x57DF;&#x540D;">&#x8D2D;&#x4E70;&#x57DF;&#x540D;</h2>
<p>&#x5728;&#x90E8;&#x7F72;&#x4E91;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5148;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x57DF;&#x540D;&#xFF0C;&#x8FD9;&#x91CC;&#x63A8;&#x8350;&#x57DF;&#x540D;&#x548C;&#x670D;&#x52A1;&#x5668;&#x5728;&#x4E00;&#x5BB6;&#x8D2D;&#x4E70;&#xFF0C;&#x4F8B;&#x5982; &#x57DF;&#x540D;&#x548C;&#x670D;&#x52A1;&#x5668;&#x90FD;&#x5728;&#x963F;&#x91CC;&#x4E91;&#x8D2D;&#x4E70;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x57FA;&#x672C;&#x4E0A;&#x4E0D;&#x80FD;&#x5B8C;&#x6210;&#x7F51;&#x7AD9;&#x7684;&#x5907;&#x6848;&#x3002;</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-01.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-1&#x3011;</center></p>
<p>&#x5982;&#x3010;&#x56FE;2-2-1&#x3011;&#x76F4;&#x63A5;&#x5728;&#x5B98;&#x7F51;&#x9876;&#x90E8;&#x641C;&#x7D22;&#x9875;&#x57DF;&#x540D;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x641C;&#x7D22;&#x6846;&#x5185;&#x8F93;&#x5165;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x7684;&#x57DF;&#x540D;&#x641C;&#x7D22;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5BF9;&#x57DF;&#x540D;&#x6CA1;&#x6709;&#x7279;&#x6B8A;&#x8981;&#x6C42;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x5F88;&#x4FBF;&#x5B9C;&#x7684;&#x57DF;&#x540D;&#xFF0C;&#x51E0;&#x5757;&#x94B1;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x5E74;&#x3002;</p>
<p>&#x540E;&#x7EED;&#x64CD;&#x4F5C;&#x57FA;&#x672C;&#x662F;&#x4E00;&#x952E;&#x8D2D;&#x4E70;&#x4E0D;&#x5728;&#x8D58;&#x8FF0;&#x3002;</p>
<h2 id="&#x8D2D;&#x4E70;&#x670D;&#x52A1;&#x5668;">&#x8D2D;&#x4E70;&#x670D;&#x52A1;&#x5668;</h2>
<p>&#x63A8;&#x8350;&#x8D2D;&#x4E70;&#x548C;&#x4F7F;&#x7528; &#x963F;&#x91CC;&#x4E91;&#x7684;  <strong><em>&#x4E91;&#x670D;&#x52A1;&#x5668;ECS</em></strong>  &#x548C;   <strong><em>&#x8F7B;&#x91CF;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;</em></strong>  &#x4E8C;&#x8005;&#x5747;&#x53EF;&#x3002;</p>
<p>&#x4EE5;&#x8FD9;&#x91CC;&#x7684;&#x5B66;&#x751F;&#x670D;&#x52A1;&#x5668;&#x4E3E;&#x4F8B;</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-02.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-2&#x3011;</center></p>
<p>&#x7ACB;&#x5373;&#x8D2D;&#x4E70;</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-03.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-3&#x3011;</center></p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-04.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-4&#x3011;</center></p>
<p>&#x6211;&#x7684;&#x5B66;&#x751F;&#x4F18;&#x60E0;&#x53EF;&#x80FD;&#x7528;&#x5B8C;&#x4E86;&#x5427;&#xFF0C;&#x8FD9;&#x91CC;&#x4EF7;&#x683C;&#x5C31;&#x4E0A;&#x6765;&#x4E86;&#xFF0C;&#x4E00;&#x4E2A;&#x6708;&#x7684;&#x8BDD;&#x5C31;&#x662F;9.5&#x5143;&#xFF0C;&#x4E09;&#x4E2A;&#x6708;&#x5C31;&#x662F;28.5&#x5143;&#x3002;</p>
<p><strong>&#x8FD9;&#x91CC;&#x7279;&#x522B;&#x63D0;&#x9192;</strong> </p>
<p>1&#x3001;&#x8BF7;&#x4E0D;&#x8981;&#x9009;&#x62E9; Windows&#x7CFB;&#x7EDF;  Windows&#x7CFB;&#x7EDF;&#x5360;&#x7528;&#x5185;&#x5B58;&#x592A;&#x5927;&#xFF0C;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x8FD9;&#x79CD;&#x914D;&#x7F6E;&#x8F83;&#x4F4E;&#x7684;&#x5B66;&#x751F;&#x670D;&#x52A1;&#x5668;&#x6765;&#x8BF4;&#xFF0C;&#x6709;&#x70B9;&#x5403;&#x529B;&#x3002;&#x6240;&#x4EE5;&#x63A8;&#x8350;&#x4F7F;&#x7528;CentOS 7.3&#x7CFB;&#x7EDF; &#x5F53;&#x7136;&#x5176;&#x4ED6;&#x7684;&#x4E5F;&#x53EF;&#x4EE5;&#x3002;</p>
<p>2&#x3001;&#x5927;&#x5BB6;&#x8981;&#x4E00;&#x6B21;&#x6027;&#x8D2D;&#x4E70;3&#x4E2A;&#x6708;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x56E0;&#x4E3A;&#x963F;&#x91CC;&#x4E91;&#x662F;&#x8D2D;&#x4E70;&#x4E86;3&#x4E2A;&#x6708;&#x4EE5;&#x4E0A;&#x7684;&#x670D;&#x52A1;&#x5668;&#x624D;&#x53EF;&#x4EE5;&#x8FDB;&#x884C; &#x57DF;&#x540D;&#x7684;&#x5907;&#x6848;&#x7684;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x5C31;&#x4E70;&#x4E09;&#x4E2A;&#x6708;&#x3002;&#x6709;&#x4E9B;&#x4E91;&#x670D;&#x52A1;&#x5668;&#x4E70;&#x4E00;&#x4E2A;&#x6708;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5907;&#x6848;&#x7684;&#xFF0C;&#x5927;&#x5BB6;&#x81EA;&#x884C;&#x9009;&#x62E9;&#x6BD4;&#x8F83;&#x3002;</p>
<h2 id="&#x914D;&#x7F6E;">&#x914D;&#x7F6E;</h2>
<h3 id="&#x5907;&#x6848;">&#x5907;&#x6848;</h3>
<p>&#x4E70;&#x5B8C;&#x4E4B;&#x540E;&#xFF0C;&#x8FDB;&#x884C;&#x7F51;&#x7AD9;&#x5907;&#x6848;&#x3002;</p>
<div class="accordion accordionClose"><div class="accordionButton"><div class="accordionTitle">&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5907;&#x6848;&#xFF1F;</div><div class="accordionSpinnerBox"><div class="accordionSpinner"></div></div></div><div class="accordionContent">
<p>&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x5728;&#x7F51;&#x4E0A;&#x4ECE;&#x4E8B;&#x975E;&#x6CD5;&#x7684;&#x7F51;&#x7AD9;&#x7ECF;&#x8425;&#x6D3B;&#x52A8;&#xFF0C;&#x6253;&#x51FB;&#x4E0D;&#x826F;&#x4E92;&#x8054;&#x7F51;&#x4FE1;&#x606F;&#x7684;&#x4F20;&#x64AD;&#xFF0C;&#x5982;&#x679C;&#x7F51;&#x7AD9;&#x4E0D;&#x5907;&#x6848;&#x7684;&#x8BDD;&#xFF0C;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x88AB;&#x67E5;&#x5904;&#x4EE5;&#x540E;&#x5173;&#x505C;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x6211;&#x4EEC;&#x5728;&#x4E0A;&#x4F20;&#x535A;&#x5BA2;&#x7684;&#x56FE;&#x7247;&#x65F6;&#xFF0C;&#x7F51;&#x7AD9;&#x7684;&#x56FE;&#x5E8A;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4F60;&#x63D0;&#x4F9B;&#x535A;&#x5BA2;&#x7684;&#x57DF;&#x540D;&#x7F51;&#x7AD9;&#xFF0C;&#x8FD9;&#x4E2A;&#x7F51;&#x7AD9;&#x662F;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x8FC7;&#x5907;&#x6848;&#x7684;&#x7F51;&#x7AD9;&#x624D;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x540E;&#x9762;&#x4F1A;&#x8BF4;&#x5230;&#x3002;</p>
</div></div>
<p>&#x5728;&#x9996;&#x9875;&#x5DE6;&#x4E0A;&#x89D2;&#x76F4;&#x63A5;&#x70B9;&#x51FB;&#x5907;&#x6848;&#x8FDB;&#x884C;&#x5907;&#x6848;</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-05.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-5&#x3011;</center></p>
<p>&#x5907;&#x6848;&#x8FC7;&#x7A0B; &#x4E5F;&#x5F88;&#x65B9;&#x4FBF; &#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x963F;&#x91CC;&#x4E91;&#x7684;&#x63D0;&#x793A;&#x8FDB;&#x884C;&#x4E0B;&#x53BB;&#xFF0C;&#x6216;&#x8005;&#x62E8;&#x6253;&#x963F;&#x91CC;&#x4E91;&#x7684;&#x5B98;&#x65B9;&#x5BA2;&#x670D;&#x8FDB;&#x884C;&#x54A8;&#x8BE2;&#x3002;</p>
<p>&#x5907;&#x6848;&#x8FC7;&#x7A0B;&#x5728;&#x5BA1;&#x6838;&#x65F6;&#x95F4;&#x57FA;&#x672C;&#x4E0A;&#x5728;5&#x5929;&#x5DE6;&#x53F3;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x4F60;&#x5728;&#x64CD;&#x4F5C;&#x5B8C;&#x540E;&#x4E00;&#x5929;&#x5185;&#x4F1A;&#x63A5;&#x5230;&#x6765;&#x81EA;&#x963F;&#x91CC;&#x7684;&#x5BA2;&#x670D;&#x7535;&#x8BDD;&#x8BE2;&#x95EE;&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5907;&#x6848;&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x89E3;&#x51B3;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x8981;&#x9519;&#x8FC7;&#x5173;&#x6CE8;&#x624B;&#x673A;&#x3002;</p>
<h3 id="&#x914D;&#x7F6E;">&#x914D;&#x7F6E;</h3>
<h4 id="&#x57DF;&#x540D;&#x89E3;&#x6790;">&#x57DF;&#x540D;&#x89E3;&#x6790;</h4>
<p>&#x628A;&#x4F60;&#x7684;&#x57DF;&#x540D;&#x6DFB;&#x52A0;&#x5230;&#x670D;&#x52A1;&#x5668;</p>
<p>&#x4F9D;&#x65E7;&#x5728;&#x5DE6;&#x4E0A;&#x89D2;&#x70B9;&#x51FB;   &#x63A7;&#x5236;&#x53F0;</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-05.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-5&#x3011;</center></p>
<p>&#x627E;&#x5230;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x5668;&#x70B9;&#x5F00;&#xFF0C;&#x7136;&#x540E;&#x627E;&#x5230;  &#x57DF;&#x540D;  &#x6DFB;&#x52A0;&#x57DF;&#x540D;  &#x6DFB;&#x52A0;&#x5B8C;&#x6210;&#x540E;  &#x70B9;&#x51FB;DNS&#x89E3;&#x6790;&#xFF0C;&#x4F1A;&#x5E2E;&#x4F60;&#x89E3;&#x6790;&#x51FA;&#x6765;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x7684;IP&#x5730;&#x5740;</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-06.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-6&#x3011;</center></p>
<p>&#x8FD9;&#x91CC;&#x56FE;&#x662F; &#x8F7B;&#x91CF;&#x578B;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668; &#x7684;&#x754C;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x662F;ECS &#x81EA;&#x5DF1;&#x6478;&#x7D22;&#x4E00;&#x4E0B;&#xFF0C;&#x57FA;&#x672C;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
<h4 id="&#x8BBE;&#x7F6E;&#x670D;&#x52A1;&#x5668;&#x5BC6;&#x7801;">&#x8BBE;&#x7F6E;&#x670D;&#x52A1;&#x5668;&#x5BC6;&#x7801;</h4>
<p>&#x56DE;&#x5230;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x5668;&#x6982;&#x89C8; &#xFF0C;&#x627E;&#x5230;&#x670D;&#x52A1;&#x5668;&#x4FE1;&#x606F;&#xFF0C;&#x672C;&#x6761;&#x540E;&#x9762;&#x627E;&#x5230;&#x91CD;&#x7F6E;&#x5BC6;&#x7801;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BC6;&#x7801;&#x662F;&#x4F60;&#x767B;&#x5F55;&#x5230;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x65F6;&#x7528;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x81EA;&#x5DF1;&#x8BB0;&#x4F4F;&#x3002;</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-07.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-7&#x3011;</center></p>
<h4 id="&#x5B9D;&#x5854;linux&#x9762;&#x677F;">&#x5B9D;&#x5854;Linux&#x9762;&#x677F;</h4>
<p>&#x501F;&#x52A9;&#x5B9D;&#x5854;Linux&#x9762;&#x677F;&#x80FD;&#x591F;&#x66F4;&#x65B9;&#x4FBF;&#x7684;&#x5B8C;&#x6210;&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x7AD9;&#x90E8;&#x7F72;&#x3002;</p>
<p><a href="https://www.bt.cn/bbs/thread-19376-1-1.html" target="_blank">&#x7F51;&#x7AD9;&#x5730;&#x5740;</a></p>
<p>&#x8FDB;&#x5165;&#x7F51;&#x5740;&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x662F;&#x6559;&#x7A0B;&#x9875;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x6309;&#x7167;&#x4E0A;&#x9762;&#x7684;&#x8981;&#x6C42;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x91CC;&#x6211;&#x8FD8;&#x662F;&#x7B80;&#x5355;&#x8BF4;&#x4E00;&#x4E0B;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x6839;&#x636E;&#x63D0;&#x793A;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x7684;&#x662F;&#x963F;&#x91CC;&#x4E91;&#xFF0C;&#x6253;&#x5F00;&#x76F8;&#x5E94;&#x8FDE;&#x63A5;</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-08.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-8&#x3011;</center></p>
<p>&#x6309;&#x7167;&#x6559;&#x7A0B;&#x8FDB;&#x884C;&#x5B89;&#x5168;&#x7EC4;&#x8BBE;&#x7F6E;&#xFF0C;&#x6839;&#x636E;&#x4ECB;&#x7ECD;&#xFF0C;&#x4E0D;&#x8BBE;&#x7F6E;&#x53EF;&#x80FD;&#x7528;&#x4E0D;&#x4E86;&#x3002;&#x6253;&#x5F00;&#x6765;&#x662F;ECS&#x7684;&#x6559;&#x7A0B;&#xFF0C;&#x8F7B;&#x91CF;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x66F4;&#x7B80;&#x5355;&#x4E00;&#x4E9B; &#x5982;&#x3010;&#x56FE;2-2-9&#x3011;</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-09.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-9&#x3011;</center></p>
<p>&#x5B8C;&#x6210;&#x540E;  &#x56DE;&#x5230;&#x9762;&#x677F;&#x5B89;&#x88C5;&#x6559;&#x7A0B;</p>
<p>&#x590D;&#x5236;Centos&#x5B89;&#x88C5;&#x547D;&#x4EE4;&#xFF08;&#x6839;&#x636E;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x9009;&#x62E9;&#x590D;&#x5236;&#xFF09;</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-10.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-10&#x3011;</center></p>
<p>&#x56DE;&#x5230;&#x4E91;&#x670D;&#x52A1;&#x5668;&#x70B9;&#x51FB;&#x6982;&#x8FF0; &#x5DE6;&#x4E0A;&#x89D2;  &#x8FDC;&#x7A0B;&#x8FDE;&#x63A5;  &#x8FDE;&#x63A5;&#x81F3;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-11.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-11&#x3011;</center></p>
<p>&#x6253;&#x5F00;&#x540E;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x6D01;&#x7684;DOS&#x754C;&#x9762;</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-12.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-12&#x3011;</center></p>
<p>&#x7D27;&#x63A5;&#x7740;&#x8F93;&#x5165; su &#x56DE;&#x8F66; &#x7136;&#x540E;&#x8F93;&#x5165;&#x5BC6;&#x7801; &#xFF0C;&#x5BC6;&#x7801;&#x662F;&#x521A;&#x521A;&#x6211;&#x4EEC;&#x91CD;&#x8BBE;&#x8FC7;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x8F93;&#x5165;&#x5BC6;&#x7801;&#x662F;&#x4E0D;&#x4F1A;&#x663E;&#x793A;&#xFF0C;&#x6CE8;&#x610F;&#x4E0D;&#x8981;&#x8F93;&#x9519;&#xFF0C;&#x8F93;&#x5B8C;&#x540E;&#x56DE;&#x8F66;&#x5C31;&#x767B;&#x5F55;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x7C98;&#x8D34;&#x6211;&#x4EEC;&#x521A;&#x521A;&#x590D;&#x5236;&#x7684;Centos&#x5B89;&#x88C5;&#x547D;&#x4EE4;&#xFF0C;&#x4F1A;&#x81EA;&#x52A8;&#x5B89;&#x88C5;&#xFF0C;&#x5927;&#x6982;&#x7B49;&#x5F85;5&#x5206;&#x949F;&#x5DE6;&#x53F3;</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-13.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-13&#x3011;</center></p>
<p>&#x5B8C;&#x6210;&#x540E;&#x5982;&#x3010;&#x56FE;2-2-13&#x3011;&#xFF0C;&#x8FD9;&#x91CC;&#x8BF7;&#x6CE8;&#x610F;&#x7EA2;&#x7EBF;&#x6846;&#x5185;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x662F;&#x4F60;&#x7684;&#x5B9D;&#x5854;&#x9762;&#x677F;&#x7684;&#x7F51;&#x5740;&#x548C;&#x8D26;&#x53F7;&#x5BC6;&#x7801;&#xFF0C;&#x8FD9;&#x4E2A;&#x81EA;&#x5DF1;&#x590D;&#x5236;&#x4E0B;&#x6765;&#x4FDD;&#x5B58;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x540E;&#x7EED;&#x64CD;&#x4F5C;&#x90FD;&#x5728;&#x9762;&#x677F;&#x4E0A;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;Waring &#x5185;&#x5BB9;&#x5C31;&#x662F;&#x63D0;&#x793A;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B;&#x7AEF;&#x53E3;&#x9700;&#x8981;&#x914D;&#x7F6E;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x521A;&#x521A;&#x914D;&#x7F6E;&#x8FC7;&#x4E86;&#x5C31;&#x4E0D;&#x7528;&#x7BA1;&#x4E86;&#x3002;</p>
<p>&#x590D;&#x5236;&#x597D;&#x521A;&#x521A;&#x7684;&#x5185;&#x5BB9;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x6253;&#x5F00; &#x4F60;&#x7684;&#x5B9D;&#x5854;&#x7F51;&#x5740;  BT-Panel &#xFF1A; &#x540E;&#x9762;&#x7684;&#x7F51;&#x5740; &#x590D;&#x5236;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x6253;&#x5F00;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x628A;&#x521A;&#x521A;&#x7684;&#x7528;&#x6237;&#x540D;&#x5BC6;&#x7801;&#x590D;&#x5236;&#x7C98;&#x8D34;&#x8FC7;&#x6765; &#x767B;&#x5F55;&#x3002;</p>
<p>&#x4F1A;&#x63D0;&#x793A;&#x4F60;&#x5B89;&#x88C5;&#x4E00;&#x4E9B;&#x8F6F;&#x4EF6;&#xFF0C;&#x70B9;&#x51FB;&#x63A8;&#x8350;&#x5B89;&#x88C5;&#x5C31;&#x53EF;&#x4EE5;&#xFF0C;&#x5927;&#x6982;&#x7B49;&#x5F85;5&#x5206;&#x949F;</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-14.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-14&#x3011;</center></p>
<p>&#x5B8C;&#x6210;&#x540E;&#x5982;&#x3010;&#x56FE;2-2-15&#x3011;&#x70B9;&#x51FB;&#x7F51;&#x7AD9; &#x6DFB;&#x52A0;&#x7AD9;&#x70B9; </p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-15.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-15&#x3011;</center></p>
<p>&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x57DF;&#x540D;&#x586B;&#x8FDB;&#x53BB;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x6DFB;&#x52A0;&#x5B8C;&#x6210;&#x540E;&#x70B9;&#x51FB;&#x6839;&#x76EE;&#x5F55;</p>
<p>&#x9009;&#x62E9;&#x4E0A;&#x4F20;   &#x9009;&#x62E9;&#x76EE;&#x5F55;</p>
<p><strong>&#x76EE;&#x5F55;&#x9009;&#x62E9;&#x4F60; &#x535A;&#x5BA2;&#x76EE;&#x5F55;&#x4E0B;&#x7684;public&#x6587;&#x4EF6;&#x5939;</strong></p>
<p>&#x5F00;&#x59CB;&#x4E0A;&#x4F20; &#x7B49;&#x5F85;&#x5B8C;&#x6210;</p>
<p>&#x8FD9;&#x6B65;&#x7684;&#x64CD;&#x4F5C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E0A;&#x4F20;Github&#x65F6;&#x7528;&#x7684;   hexo d  &#x547D;&#x4EE4; &#x662F;&#x4E00;&#x6837;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#x6BCF;&#x6B21;&#x6709;&#x65B0;&#x7684;&#x535A;&#x5BA2;&#x5185;&#x5BB9;&#x6216;&#x8005;&#x66F4;&#x6539;&#x4E86;&#x535A;&#x5BA2;&#x90FD;&#x8BB0;&#x5F97;&#x8981;&#x5728;&#x5B9D;&#x5854;&#x9762;&#x677F;&#x4E0A;&#x4F20;public&#x6587;&#x4EF6;&#x5939;</p>
<p>&#x8FD9;&#x6837;&#x5C31;&#x5DF2;&#x7ECF;&#x6210;&#x529F;&#x4E0A;&#x4F20;&#x5230;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x6709;&#x6700;&#x540E;&#x4E24;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5C0F;&#x6B65;&#x9AA4;&#x7684;&#x5185;&#x5BB9;&#x9700;&#x8981;&#x64CD;&#x4F5C;&#x8BF7;&#x4E0D;&#x8981;&#x7740;&#x6025;&#xFF01;</p>
<h4 id="&#x6700;&#x540E;&#x4E24;&#x5C0F;&#x6B65;">&#x6700;&#x540E;&#x4E24;&#x5C0F;&#x6B65;</h4>
<h5 id="1&#x3001;&#x66F4;&#x6539;config&#x6587;&#x4EF6;">1&#x3001;&#x66F4;&#x6539;Config&#x6587;&#x4EF6;</h5>
<p>&#x627E;&#x5230;url</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-16.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-16&#x3011;</center></p>
<p>&#x8FD9;&#x91CC;&#x586B;&#x5165;&#x81EA;&#x5DF1;&#x535A;&#x5BA2;&#x7684;&#x57DF;&#x540D;</p>
<h5 id="2&#x3001;&#x66F4;&#x6539;github-pages">2&#x3001;&#x66F4;&#x6539;Github Pages</h5>
<p>&#x6253;&#x5F00;Github&#x5BF9;&#x5E94;&#x4ED3;&#x5E93; &#x70B9;&#x51FB;&#x8BBE;&#x7F6E; &#x4E0B;&#x62C9;&#x627E;&#x5230; Github Pages</p>
<p>&#x6309;&#x7167;&#x5982;&#x3010;&#x56FE;2-2-17&#x3011;&#x4F4D;&#x7F6E;&#x8F93;&#x5165;&#x4F60;&#x7684;&#x57DF;&#x540D; &#x4FDD;&#x5B58;Save</p>
<p>  <div align="center"> <img src="http://cdn.icecold.xyz/%E5%9B%BE2-2-17.png" hight="width="></div>
  <center>&#x3010;&#x56FE;2-2-17&#x3011;</center></p>
<p>&#x597D;&#x4E86;&#x5927;&#x529F;&#x544A;&#x6210;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x8F93;&#x5165;&#x4F60;&#x7684;&#x57DF;&#x540D;&#x5C31;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5230;&#x4F60;&#x7684;&#x535A;&#x5BA2;&#x4E86;&#xFF01;</p>
<center><font color="blue" size="5">Hexo&#x90E8;&#x7F72;&#x5728;&#x4E91;&#x4E0A;&#x6B65;&#x9AA4;&#x5DF2;&#x5B8C;&#x6210;&#xFF01; </font> </center> 


                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="第二章第一节.html" class="navigation navigation-prev " aria-label="Previous page: 方式一：部署在Github">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="排版.html" class="navigation navigation-next " aria-label="Next page: 排版">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"方式二：部署在云上","level":"1.4.2","depth":2,"next":{"title":"排版","level":"1.5","depth":1,"path":"排版.md","ref":"排版.md","articles":[]},"previous":{"title":"方式一：部署在Github","level":"1.4.1","depth":2,"path":"第二章第一节.md","ref":"第二章第一节.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","search-pro","back-to-top-button","toggle-chapters","click-reveal","accordion","hide-element","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search-pro":{},"accordion":{},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"click-reveal":{},"highlight":{},"back-to-top-button":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"toggle-chapters":{}},"theme":"default","author":"Icecold","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"HEXO电子书","gitbook":"*","description":"记录Gitbook的配置和一些插件的使用，寻找替代方法"},"file":{"path":"第二章第二节.md","mtime":"2020-05-08T11:04:13.270Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-05-08T11:04:37.581Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-toggle-chapters/toggle.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-click-reveal/click_reveal.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-accordion/accordionSelector.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

